In [1]:
# importing libraries

import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import scipy.stats as scp

In [2]:
#reading data set

data = pd.read_csv('Advertising.csv')
data.head()

   Unnamed: 0     TV  Radio  Newspaper  Sales
0           1  230.1   37.8       69.2   22.1
1           2   44.5   39.3       45.1   10.4
2           3   17.2   45.9       69.3    9.3
3           4  151.5   41.3       58.5   18.5
4           5  180.8   10.8       58.4   12.9

# 1. Explain the dataset

In [3]:
#primary data analysis

data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  200 non-null    int64
 1   TV          200 non-null    float64
 2   Radio       200 non-null    float64
 3   Newspaper   200 non-null    float64
 4   Sales       200 non-null    float64
dtypes: float64(4), int64(1)
memory usage: 7.9 KB

In [4]:
#imported data set
data

     Unnamed: 0     TV  Radio  Newspaper  Sales
0             1  230.1   37.8       69.2   22.1
1             2   44.5   39.3       45.1   10.4
2             3   17.2   45.9       69.3    9.3
3             4  151.5   41.3       58.5   18.5
4             5  180.8   10.8       58.4   12.9
..          ...    ...    ...        ...    ...
195         196   38.2    3.7       13.8    7.6
196         197   94.2    4.9        8.1    9.7
197         198  177.0    9.3        6.4   12.8
198         199  283.6   42.0       66.2   25.5
199         200  232.1    8.6        8.7   13.4

[200 rows x 5 columns]

In [14]:
data.isna().sum()

Unnamed: 0    0
TV            0
Radio         0
Newspaper     0
Sales         0
dtype: int64

Explanation:

There are 200 rows and 5 columns in the data set
The given dataset consists of advertisement expenses on three different medias(TV,Radio and Newspaper) and the sales.
There is no Null values in the Dataset

# 2. Check the summary statistics and discuss the max, min, avg, median, and percentiles.

In [16]:
data_clean = data.drop('Unnamed: 0',axis=1)   #Droped the serial number column

In [17]:
data_clean.describe()

               TV       Radio   Newspaper       Sales
count  200.000000  200.000000  200.000000  200.000000
mean   147.042500   23.264000   30.554000   14.022500
std     85.854236   14.846809   21.778621    5.217457
min      0.700000    0.000000    0.300000    1.600000
25%     74.375000    9.975000   12.750000   10.375000
50%    149.750000   22.900000   25.750000   12.900000
75%    218.825000   36.525000   45.100000   17.400000
max    296.400000   49.600000  114.000000   27.000000

# a)minimum value

In [18]:
min_value = np.min(data_clean)
print(min_value)

TV           0.7
Radio        0.0
Newspaper    0.3
Sales        1.6
dtype: float64

In [20]:
#Advertisement in Radio has the min value of 0.0

# b)maximum values

In [19]:
max_value = np.max(data_clean)
print(max_value)

TV           296.4
Radio         49.6
Newspaper    114.0
Sales         27.0
dtype: float64

In [21]:
#Advertisement in TV has the Max value of 296.4

# c)average values

In [22]:
data_clean.mean()

TV           147.0425
Radio         23.2640
Newspaper     30.5540
Sales         14.0225
dtype: float64

In [23]:
#Maximum amount for advertising is spent through TV

# d)median values

In [26]:
data_clean.median()

TV           149.75
Radio         22.90
Newspaper     25.75
Sales         12.90
dtype: float64

In [27]:
#Advertisement in TV has larger spendings

# e)percentiles values

In [24]:
data_clean.quantile([.25,.5,.75])

           TV   Radio  Newspaper   Sales
0.25   74.375   9.975      12.75  10.375
0.50  149.750  22.900      25.75  12.900
0.75  218.825  36.525      45.10  17.400

Summary:
Maximum amount for advertising is spent through TV and the least is spent through the radio.
Overall mean
  TV : 147.0425
  Radio : 23.2640
  Newspaper : 30.5540
Overall Median
  TV : 149.75
  Radio : 22.90
  Newspaper : 25.75

# 3. The manager wants to find out whether the same amount was spent for the three advertisements (TV , Radio and Newspaper). Comment on your findings.

In [9]:
## Since we have to check one factor sales over 3 different Advertisements we will use one way Anova

# Hypothesis
# H0: Amount spent for all categories are the same
# H1: Amount spent for all categories are different

In [28]:
#ANOVA Test
f_value , p_value = scp.f_oneway(data_clean['TV'], data_clean['Radio'], data_clean['Newspaper'])
print('The f value is:',f_value)
print('The p value is:',p_value)

The f value is: 358.8514595342597
The p value is: 4.552931539744962e-103

In [29]:
if(p_value<0.05):
   print('Reject H0: Amount spent for all categories are the same and Accept H1')
else:
   print('Fail to Reject H0: Amount spent for all categories are the same and Accept H0')

Reject H0: Amount spent for all categories are the same and Accept H1

Null hypothesis is rejected.
So,the Amount spent for all categories are Different